Revit 2026 API

# AreaBasedLoadBoundaryLineDataBottomLevelId Property

---

The bottom level id of the area based load boundary line.

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public ElementId BottomLevelId { get; set; }
```
```vb
Public Property BottomLevelId As ElementId
	Get
	Set
```
```cpp
public:
property ElementId^ BottomLevelId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```
```fsharp
member BottomLevelId : ElementId with get, set
```

#### Property Value

ElementId

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The ElementId levelId cannot be used as the bottom level. The ElementId levelId is not a Level or it's elevation is higher than the top level's elevation. |
| ArgumentNullException | When setting this property: A non-optional argument was null |

The bottom level's elevation cannot be higher than the top level.

#### Reference

AreaBasedLoadBoundaryLineData Class

Autodesk.Revit.DB.Electrical Namespace